[
  {
    "sender": "RAJ KUMAR",
    "timestamp": "Feb 20",
    "preview": " RAJ sent an attachment",
    "is_potential_referral": true,
    "has_resume_downloaded": true,
    "messages": [
      {
        "content": "Dear Radhika,\n\nI hope you’re doing well. I am a third-year Computer Science student at Maharishi Markandeshwar University and am interested in applying for the 2025 Software Engineer Intern (Job ID: R147746) position at Adobe.\n\nWith experience in Java, JavaScript, Python, and full-stack development, I have interned at Edunet Foundation, working on AI-based solutions, and served as a Teaching Assistant at Coding Ninjas, mentoring over 1,600 students. My problem-solving abilities are demonstrated by 650+ solved LeetCode problems and my recognition as a LinkedIn Top Voice in Systems Design for my insights on scalable solutions.\n\nI would greatly appreciate your referral for this opportunity. Please let me know if you’d be open to supporting my application. I’d be happy to share my resume or any additional details.\n\nBest regards,\nRaj Kumar\nEmail: raj.kumarcse58@gmail.com",
        "emails": [
          "raj.kumarcse58@gmail.com"
        ],
        "attachments": [
          {
            "filename": "RAJ_KUMAR_resume.pdf",
            "saved_path": "resumes/RAJ_KUMAR_resume.pdf",
            "original_url": "https://www.linkedin.com/dms/prv/vid/v2/D5606AQEQyDRG0yEmQA/messaging-attachmentFile/messaging-attachmentFile/0/1740051621967?m=AQK1RnjRASneuwAAAZbLAJVmdkJohQUURNJJTBXfCYYlKLLwvMmp1DmWug&ne=1&v=beta&t=XjkA2dTMKqC9Svs4HsOFOupIgFkR1N6iXkWfXOdh6SU",
            "is_resume": true
          }
        ],
        "attachment_downloaded": "RAJ_KUMAR_resume.pdf"
      }
    ]
  },
  {
    "sender": "Jeel Tolia",
    "timestamp": "Feb 11",
    "preview": "Jeel: Job Referral at Adobe (JobId: R153475, R152782) I hope you’re doing well! I’m reaching out because I noticed an opportunity at Adobe that aligns well with my skills and experience, particularly my recent work at Goldman Sachs. I kindly request you to please refer me for the job opportunity. Resume: https://drive.google.com/file/d/1LisTb2isHF2oUxATZgpoZOReLxRlgFz-/view Thanks, Jeel",
    "is_potential_referral": true,
    "has_resume_downloaded": true,
    "google_drive_links": [
      "https://drive.google.com/file/d/1LisTb2isHF2oUxATZgpoZOReLxRlgFz-/view"
    ],
    "messages": [
      {
        "content": "Job Referral at Adobe (JobId: R153475, R152782)\n\nI hope you’re doing well! I’m reaching out because I noticed an opportunity at Adobe that aligns well with my skills and experience, particularly my recent work at Goldman Sachs.\n\nI kindly request you to please refer me for the job opportunity.\n\nResume: https://drive.google.com/file/d/1LisTb2isHF2oUxATZgpoZOReLxRlgFz-/view\n\nThanks,\nJeel",
        "google_drive_links": [
          "https://drive.google.com/file/d/1LisTb2isHF2oUxATZgpoZOReLxRlgFz-/view"
        ]
      }
    ]
  }
]